{
  "job_id": "3ffb62a2",
  "status": "Completed",
  "total_files": 4,
  "processed_files": 4,
  "successful_files": 4,
  "failed_files": 0,
  "skipped_files": 0,
  "skipped_reasons": {
    "unknown_format": 0,
    "file_size_limit": 0,
    "page_limit": 0
  },
  "corrupt_files": 0,
  "start_time": "2025-09-16T21:17:24.377608",
  "end_time": "2025-09-16T21:17:33.649844",
  "current_file": "Teaching Artificial Intelligence.pdf",
  "progress_percentage": 100,
  "metadata_options": [
    "author",
    "published_date",
    "abstract",
    "title",
    "topic"
  ],
  "results": [
    {
      "filename": "AI Financial Sector.pdf",
      "success": true,
      "timestamp": "2025-09-16T21:17:27.410976",
      "metadata": {
        "title": "Artificial Intelligence (AI) in the Financial Sector",
        "author": [
          {
            "first_name": "Ririn",
            "last_name": "Riani",
            "full_name": "Ririn Riani"
          },
          {
            "first_name": "D",
            "last_name": "Yang",
            "full_name": "D Yang"
          },
          {
            "first_name": "Krishna",
            "last_name": "Khan",
            "full_name": "Krishna Khan"
          },
          {
            "first_name": "S",
            "last_name": "Singh",
            "full_name": "S Singh"
          }
        ],
        "abstract": "This study aims to see the development of research on the topic of \"AI on Finance\" and research plans that can be carried out based on journals published on the theme. This research uses qualitative method with bibliometric analysis approach. The data used is secondary data with the theme \"AI on Finance\" which comes from the Dimension database with a total of 127 journal articles. Then, the data is processed and analyzed using the VosViewer application with the aim of knowing the bibliometric map of research development \"AI on Finance\" in the world. The results of the study found that in bibliometric author mapping the authors who published the most research with the theme \"AI on Finance\" were",
        "published_date": "31 December 2023",
        "topic": "AI, Finance, Research Map, Artificial Intelligence",
        "text": "INTRODUCTIONThe development of Artificial Intelligence (AI) has been a long and evolving process, which began in the mid-20th century. The term \"artificial intelligence\" was coined by John McCarthy at a conference at Dartmouth College in 1956, marking the beginning of the scientific field of AI (Xu et al., 2021). Initially, AI research focused on automated reasoning and applied AI to prove mathematical theorems and solve algebraic problems. The 1980s saw a resurgence of AI research, with the dev...",
        "file_type": "PDF",
        "upload_date": "2025-09-16T21:17:27.409805",
        "job_id": "3ffb62a2",
        "parser": "GROBID",
        "file_size": 457544
      },
      "error": null,
      "skip_reason": null
    },
    {
      "filename": "Factual Predictions.pdf",
      "success": true,
      "timestamp": "2025-09-16T21:17:29.806267",
      "metadata": {
        "title": "How Context Affects Language Models' Factual Predictions",
        "author": [
          {
            "first_name": "Fabio",
            "last_name": "Petroni",
            "full_name": "Fabio Petroni"
          },
          {
            "first_name": "Patrick",
            "last_name": "Lewis",
            "full_name": "Patrick Lewis"
          },
          {
            "first_name": "Tim",
            "last_name": "Rocktäschel",
            "full_name": "Tim Rocktäschel"
          },
          {
            "first_name": "Yuxiang",
            "last_name": "Wu",
            "full_name": "Yuxiang Wu"
          },
          {
            "first_name": "Alexander",
            "last_name": "Miller",
            "full_name": "Alexander Miller"
          },
          {
            "first_name": "Sebastian",
            "last_name": "Riedel",
            "full_name": "Sebastian Riedel"
          }
        ],
        "abstract": "When pre-trained on large unsupervised textual corpora, language models are able to store and retrieve factual knowledge to some extent, making it possible to use them directly for zero-shot cloze-style question answering. However, storing factual knowledge in a fixed number of weights of a language model clearly has limitations. Previous approaches have successfully provided access to information outside the model weights using supervised architectures that combine an information retrieval system with a machine reading component. In this paper, we go a step further and integrate information from a retrieval system with a pre-trained language model in a purely unsupervised way. We report that augmenting pre-trained language models in this way dramatically improves performance and that the resulting system, despite being unsupervised, is competitive with a supervised machine reading baseline. Furthermore, processing query and context with different segment tokens allows BERT to utilize its Next Sentence Prediction pre-trained classifier to determine whether the context is relevant or not, substantially improving BERT's zeroshot cloze-style question-answering performance and making its predictions robust to noisy contexts.",
        "published_date": "10 May 2020",
        "topic": "",
        "text": "IntroductionPre-trained language models such as BERT [Devlin et al., 2019] and RoBERTa [Liu et al., 2019] enabled state-of-the-art in many downstream NLP tasks [Wang et al., 2018a, 2019, Wu et al., 2019]. These models are trained in an unsupervised way from large textual collection and recent work [Petroni et al., 2019, Jiang et al., 2019, Talmor et al., 2019, Devlin et al., 2019] has demonstrated that such language models can store factual knowledge to some extent. However, considering the mill...",
        "file_type": "PDF",
        "upload_date": "2025-09-16T21:17:29.805667",
        "job_id": "3ffb62a2",
        "parser": "GROBID",
        "file_size": 599811
      },
      "error": null,
      "skip_reason": null
    },
    {
      "filename": "Artificial Intelligence Chatbot.pdf",
      "success": true,
      "timestamp": "2025-09-16T21:17:31.692266",
      "metadata": {
        "title": "Artificial Intelligence (AI) Chatbot as Language Learning Medium: An inquiry",
        "author": [
          {
            "first_name": "Nuria",
            "last_name": "Haristiani",
            "full_name": "Nuria Haristiani"
          }
        ],
        "abstract": "In facing industry revolution 4.0, utilizing advanced information and computer technology in educational environment is crucial. One of the advanced computation technologies that can be used for learning, especially language learning, is chatbot. Chatbot is a computer program based on artificial intelligence that can carry out conversations through audio or text. This study intends to find out and analyze the types of artificial intelligence in the form of chatbots and the possibility of their use as language learning medium. The data in this study obtained from literature review on chatbot researches, and from observation results on chatbot-based language learning medium developed by the author. The results indicated that chatbots have a high potential to be used as a language learning medium, both as tutor in practicing language, and as independent learning medium. Moreover, research results revealed that language learners are interested in using chatbots because they can be used anytime and anywhere, and they are more confident in learning languages using chatbots than when dealing directly with human tutors.",
        "published_date": "",
        "topic": "",
        "text": "IntroductionThe industrial revolution 4.0 has an impact on the urgency of education field to be able to keep up with these developments, which later brought the term Education 4.0 [1,2,3]. In embodying Education 4.0, one of the most required ability from educators and educational practitioners is to be able to integrate modern technology in their teaching [3]. The rapid development of smart phone technology, social media, and artificial intelligence (AI), provide challenges for educational pract...",
        "file_type": "PDF",
        "upload_date": "2025-09-16T21:17:31.690599",
        "job_id": "3ffb62a2",
        "parser": "GROBID",
        "file_size": 424555
      },
      "error": null,
      "skip_reason": null
    },
    {
      "filename": "Teaching Artificial Intelligence.pdf",
      "success": true,
      "timestamp": "2025-09-16T21:17:33.649353",
      "metadata": {
        "title": "Teaching Artificial Intelligence (AI) with AI for AI applications",
        "author": [
          {
            "first_name": "Keith",
            "last_name": "Brawner",
            "full_name": "Keith Brawner"
          },
          {
            "first_name": "Ning",
            "last_name": "Wang",
            "full_name": "Ning Wang"
          },
          {
            "first_name": "Ben",
            "last_name": "Nye",
            "full_name": "Ben Nye"
          }
        ],
        "abstract": "The emergence of widely-used artificial intelligence (AI) has created a critical need for AI expertise, not just as a research area but for workers in the wide variety of careers and roles that AI disrupts. While AI is still an area of research for new processing, application, and development -it continues to partially automate, augment, or replace many of the tasks which are performed through active use of human hands. While recently publicized items such as ChatGPT and MidJourney have made press in their adjustment to writing and image generation technology, the basic workflow of copyeditors and digital artists was completely transformed, inside of the year, to a combination of partially automated or fully automated AI tasks. While some blame AI as part of the \"problem\", it is naturally part of the \"solution\" -AI tools to help workers develop AI competencies. The paper describes an array of strategies which the DoD and its ICT UARC are using to address the fundamental problem of quickly upskilling the DoD workforce of over 2 million adult learners.",
        "published_date": "",
        "topic": "",
        "text": "IntroductionArtificial intelligence is increasingly critical to modern operations. However, shortages in the number of AI professors and trainers mean that growing AI competencies in the military is not simply a matter of putting Soldiers in classrooms, and despite progress in areas such as intelligent tutoring systems, AI-driven tutoring for learning AI competencies has not been fully realized. The Government Accountability Office has directly criticized the Department of Defense (DoD) for thei...",
        "file_type": "PDF",
        "upload_date": "2025-09-16T21:17:33.648770",
        "job_id": "3ffb62a2",
        "parser": "GROBID",
        "file_size": 197390
      },
      "error": null,
      "skip_reason": null
    }
  ]
}