{
  "title": "Teaching Artificial Intelligence (AI) with AI for AI applications",
  "author": [
    {
      "first_name": "Keith",
      "last_name": "Brawner",
      "full_name": "Keith Brawner"
    },
    {
      "first_name": "Ning",
      "last_name": "Wang",
      "full_name": "Ning Wang"
    },
    {
      "first_name": "Ben",
      "last_name": "Nye",
      "full_name": "Ben Nye"
    }
  ],
  "abstract": "The emergence of widely-used artificial intelligence (AI) has created a critical need for AI expertise, not just as a research area but for workers in the wide variety of careers and roles that AI disrupts. While AI is still an area of research for new processing, application, and development -it continues to partially automate, augment, or replace many of the tasks which are performed through active use of human hands. While recently publicized items such as ChatGPT and MidJourney have made press in their adjustment to writing and image generation technology, the basic workflow of copyeditors and digital artists was completely transformed, inside of the year, to a combination of partially automated or fully automated AI tasks. While some blame AI as part of the \"problem\", it is naturally part of the \"solution\" -AI tools to help workers develop AI competencies. The paper describes an array of strategies which the DoD and its ICT UARC are using to address the fundamental problem of quickly upskilling the DoD workforce of over 2 million adult learners.",
  "published_date": "",
  "topic": "",
  "text": "IntroductionArtificial intelligence is increasingly critical to modern operations. However, shortages in the number of AI professors and trainers mean that growing AI competencies in the military is not simply a matter of putting Soldiers in classrooms, and despite progress in areas such as intelligent tutoring systems, AI-driven tutoring for learning AI competencies has not been fully realized. The Government Accountability Office has directly criticized the Department of Defense (DoD) for thei...",
  "file_type": "PDF",
  "upload_date": "2025-09-16T21:12:59.489322",
  "job_id": "88dbba37",
  "parser": "GROBID",
  "file_size": 197390
}