{
  "title": "Artificial Intelligence (AI) Chatbot as Language Learning Medium: An inquiry",
  "author": [
    {
      "first_name": "Nuria",
      "last_name": "Haristiani",
      "full_name": "Nuria Haristiani"
    }
  ],
  "abstract": "In facing industry revolution 4.0, utilizing advanced information and computer technology in educational environment is crucial. One of the advanced computation technologies that can be used for learning, especially language learning, is chatbot. Chatbot is a computer program based on artificial intelligence that can carry out conversations through audio or text. This study intends to find out and analyze the types of artificial intelligence in the form of chatbots and the possibility of their use as language learning medium. The data in this study obtained from literature review on chatbot researches, and from observation results on chatbot-based language learning medium developed by the author. The results indicated that chatbots have a high potential to be used as a language learning medium, both as tutor in practicing language, and as independent learning medium. Moreover, research results revealed that language learners are interested in using chatbots because they can be used anytime and anywhere, and they are more confident in learning languages using chatbots than when dealing directly with human tutors.",
  "published_date": "",
  "topic": "",
  "text": "IntroductionThe industrial revolution 4.0 has an impact on the urgency of education field to be able to keep up with these developments, which later brought the term Education 4.0 [1,2,3]. In embodying Education 4.0, one of the most required ability from educators and educational practitioners is to be able to integrate modern technology in their teaching [3]. The rapid development of smart phone technology, social media, and artificial intelligence (AI), provide challenges for educational pract...",
  "file_type": "PDF",
  "upload_date": "2025-09-16T21:17:31.690599",
  "job_id": "3ffb62a2",
  "parser": "GROBID",
  "file_size": 424555
}