{
  "title": "A new decade for social changes 9 772668 779000",
  "author": [
    {
      "first_name": "Angeliki",
      "last_name": "Sideraki",
      "full_name": "Angeliki Sideraki"
    },
    {
      "first_name": "Athanasios",
      "last_name": "Drigas",
      "full_name": "Athanasios Drigas"
    },
    {
      "first_name": "N",
      "last_name": "Demokritos",
      "full_name": "N Demokritos"
    }
  ],
  "abstract": "This paper examines the issue of artificial intelligence and its association with autism. More specifically, at a first level, reference is made to the concept of artificial intelligence, but also to concepts that are directly related and are an extension of it. In addition, the various areas in which the use of artificial intelligence is identified are presented, while the concept of autism and its connection to technology are also analyzed. As research progresses on artificial intelligence and the diagnosis of autism. More specifically, the role of artificial intelligence is now particularly active in diagnosing various disorders including autism. Innovative methods are involved in this process. The following is a summary of research that can help people diagnose autism more easily with the help of machine learning and other technologies. The presence of genetics plays a crucial role as through the identification of different genes of people with autism several conclusions have been drawn. Finally, there are some studies that have studied the role of artificial intelligence in the treatment and intervention of autism. These include robots with artificial intelligence, virtual reality (VR), chatbots, etc. and whether all of this is considered effective for the development and empowerment of children in areas with difficulties such as speech and socialization.",
  "published_date": "",
  "topic": "Artificial intelligence, deep learning, education, special education, autism",
  "text": "1.Introduction It is undeniable that artificial intelligence has been of particular concern to the scientific community in recent years. One of the areas identified is education providing assistance with the use of various educational software. At the same time, it supports students who are faced with learning difficulties, but also autism. In addition, it can be understood how the teaching and learning process is affected, as it is easy to modify and turn the lesson into an interesting world of...",
  "file_type": "PDF",
  "upload_date": "2025-09-16T21:12:54.346553",
  "job_id": "88dbba37",
  "parser": "GROBID",
  "file_size": 2244744
}